app/controllers/songs_controller.rb

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 1]]
SELECT "songs".* FROM "songs" WHERE "songs"."artist_id" = ?  [["artist_id", 1]]
---
  def index
    # byebug
    if params[:artist_id]
      artist = Artist.find_by(id: params[:artist_id])
      if artist.nil?
        flash[:alert] = "Artist not found"
        redirect_to artists_path
      else
        @songs = artist.songs
        if @songs.nil?
          flash[:alert] = "Song not found"
          redirect_to artists_path
        end
      end
    else
      @songs = Song.all

SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 2]]
---
  def show
    @song = Song.find_by(id: params[:id])
    if params[:artist_id]
      if @song.nil?
        # byebug
        if Artist.find_by(id: params[:artist_id]).nil?